Documents/ЛБ_АкцииМеталлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_АкцииМеталлы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_АкцииМеталлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьНулевыеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияАкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановитьЗначениеИлиОтконение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_УстановкаЗначенияИлиОтклонения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеОтЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_АкцииМеталлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_АкцииМеталлы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_АкцииМеталлы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура формирует таблицы по табличным частям документа.
//
Процедура ПодготовитьТаблицыДокумента(ТаблицаЦен) Экспорт
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_АкцииМеталлыУсловияАкции.Ссылка.Акция КАК Акция,
	               |	ЛБ_АкцииМеталлыУсловияАкции.Проба КАК Проба,
	               |	ЛБ_АкцииМеталлыУсловияАкции.Категория КАК Категория,
	               |	ЛБ_АкцииМеталлыУсловияАкции.СхемаКредитования КАК СхемаКредитования,
	               |	ЛБ_АкцииМеталлыУсловияАкции.УстановитьЗначениеИлиОтконение КАК УстановитьЗначениеИлиОтконение,
	               |	ЛБ_АкцииМеталлыУсловияАкции.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЛБ_АкцииМеталлыУсловияАкции.Цена КАК Цена,
	               |	ЛБ_АкцииМеталлыУсловияАкции.ОтклонениеОтЦены КАК ОтклонениеОтЦены,
	               |	ЛБ_АкцииМеталлыУсловияАкции.ЗначениеОтклонения КАК ЗначениеОтклонения
	               |ИЗ
	               |	Документ.ЛБ_АкцииМеталлы.УсловияАкции КАК ЛБ_АкцииМеталлыУсловияАкции
	               |ГДЕ
	               |	ЛБ_АкцииМеталлыУсловияАкции.Ссылка = &Ссылка";
		
	РезультатЗапросаПоТоварам = Запрос.Выполнить();

	// Подготовим таблицу товаров для проведения.
	ТаблицаЦен = ПодготовитьТаблицуЦен(РезультатЗапросаПоТоварам);

КонецПроцедуры // ПодготовитьТаблицыДокумента()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуЦен(РезультатЗапросаПоТоварам) Экспорт

	ТаблицаЗапроса = РезультатЗапросаПоТоварам.Выгрузить();

	ТаблицаЦен = ТаблицаЗапроса.Скопировать();
	ТаблицаЦен.Очистить();
	ТаблицаЦен.Колонки.Добавить("Ломбард");

	Если Ломбарды.Количество() = 0 Тогда
		ВыборкаЛ = Справочники.ЛБ_Ломбарды.Выбрать();
		Пока ВыборкаЛ.Следующий() Цикл
			Если ВыборкаЛ.ЭтоГруппа тогда
				Продолжить;
			ИначеЕсли ВыборкаЛ.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;	

			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = ВыборкаЛ.Ссылка; 
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;   
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена;
				НоваяСтр.ОтклонениеОтЦены = Стр.ОтклонениеОтЦены;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
    Иначе
		Для каждого СтрЛ Из Ломбарды Цикл		
			Для каждого Стр Из  ТаблицаЗапроса Цикл
				Если ЭтотОбъект.НеПроводитьНулевыеЗначения И (Стр.Цена = 0) Тогда
					Продолжить;
				КонецЕсли;	
				НоваяСтр = ТаблицаЦен.Добавить();
				НоваяСтр.Ломбард = СтрЛ.Ломбард; 
				НоваяСтр.Акция = Стр.Акция;
				НоваяСтр.Проба = Стр.Проба;
				НоваяСтр.Категория = Стр.Категория;   
				НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
				НоваяСтр.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
	            НоваяСтр.Цена = Стр.Цена; 
				НоваяСтр.ОтклонениеОтЦены = Стр.ОтклонениеОтЦены;
				НоваяСтр.ЗначениеОтклонения = Стр.ЗначениеОтклонения;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат ТаблицаЦен;

КонецФункции // ПодготовитьТаблицуТоваров()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦен, Отказ)
	
	Движения.ЛБ_АкцииМеталлы.Записывать = Истина;
    Для Каждого ТекСтрокаЦены Из ТаблицаЦен Цикл
		Движение = Движения.ЛБ_АкцииМеталлы.Добавить();
		Движение.Период = Дата;
		Движение.ДатаНачалаДействия = ?(ДатаНачалаДействия = Дата(1,1,1), Дата, ?(ДатаНачалаДействия < Дата, Дата, ДатаНачалаДействия));  
		Движение.ДатаОкончанияДействия = ДатаОкончанияДействия; 
		Движение.Акция = ТекСтрокаЦены.Акция;
		Движение.Ломбард = ТекСтрокаЦены.Ломбард;
		Движение.Проба = ТекСтрокаЦены.Проба;
		Движение.Категория = ТекСтрокаЦены.Категория;  
		Движение.СхемаКредитования = ТекСтрокаЦены.СхемаКредитования;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦены.ЕдиницаИзмерения;
		Движение.Цена = ТекСтрокаЦены.Цена; 
		Движение.Отклонение = ТекСтрокаЦены.ОтклонениеОтЦены; 
		Движение.ЗначениеОтклонения = ТекСтрокаЦены.ЗначениеОтклонения;
	КонецЦикла;
		
КонецПроцедуры // ДвиженияПоРегистрам()

#Область ОбработчикиСобытий
// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	ЛБ_ОбщийМодуль.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаЦен;
	
	ПодготовитьТаблицыДокумента(ТаблицаЦен);
		
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ТаблицаЦен, Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#КонецЕсли
